# Лабораторна робота №1. Основи Python
# Варіант: 11
# ПІБ: Фесюк Максим Ігорович

# Введення данних з перевіркою на коректність
while True:
    try:
        a = float(input("Введіть довжину першої сторони трикутника(см): "))
        b = float(input("Введіть довжину другої сторони трикутника(см): "))
        c = float(input("Введіть довжину третьої сторони трикутника(см): "))
        if a<=0 or b<=0 or c<=0:
             raise ValueError("Довжина сторони трикутника повинна бути додатнім числом.")
        if (a + b <= c) or (a + c <= b) or (b + c <= a):
             raise ValueError("Трикутник з такими сторонами не існує!")
        break
    except ValueError as e:
        print(f"Помилка {e}. Спробуйте ще раз.")

#обчислення периметру та площі трикутника
p = a + b + c
polup = p / 2
area = (polup*(polup-a)*(polup-b)*(polup-c)) ** 0.5

#виведення рузультату
print("\nРезультат обчислень:")
print(f"Периметр трикутника: {p:.2f} см")
print(f"Площа трикутника: {area:.2f} см ")

#додаткова інформація
if a == b == c:
    print("Це рівносторонній трикутник.")
elif  a == b or a == c or b == c:
    print("Це рівнобедрений трикутник.")
else:
    print("Це різносторонній трикутник.")
# Не забувайте форматувати вивід та додавати коментарі!